# SetComponentFollowBottomWallPeaks

## Description
Sets the follow bottom wall peaks flag of a component in an object.

```pascal
FUNCTION SetComponentFollowBottomWallPeaks(
				obj                   : HANDLE;
				componentIndex        : INTEGER;
				followBottomWallPeaks : BOOLEAN): BOOLEAN;
```

```python
def vs.SetComponentFollowBottomWallPeaks(obj, componentIndex, followBottomWallPeaks):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE|The object. Can be a wall, round wall, Wall Style, or the Wall Preferences.|
|componentIndex|INTEGER|The index of the component.|
|followBottomWallPeaks|BOOLEAN|Whether or not the component will follow bottom wall peaks.|

## Examples
```pascal
resultOK := SetComponentFollowBottomWallPeaks(obj, 1, TRUE);
```
```python
import vs

# Sets the follow bottom wall peaks flag of a component in an object.
obj = vs.FSActLayer()  # handle to the first selected object on the active layer
componentIndex = 1
followBottomWallPeaks = True

ok = vs.SetComponentFollowBottomWallPeaks(obj, componentIndex, followBottomWallPeaks)
if ok:
    vs.Message('SetComponentFollowBottomWallPeaks succeeded')
else:
    vs.Message('SetComponentFollowBottomWallPeaks failed')
```

## See Also
VS Functions:
GetComponentFollowBottomWallPeaks

## Version
Availability: from Vectorworks 2011

## Category
* Objects - Architectural